angfigueroa/PIC16F877A/LEDS.c
/* 
 * File:   NUEVO.c
 * Author: ANGELA
 *
 * Created on 9 de mayo de 2023, 15:06
 */

#include <xc.h>
#define _XTAL_FREQ 20000000 //Para el uso del __delay_ms() o __delay_us()

// PIC16F877A Configuration Bit Settings

// 'C' source line config statements

// CONFIG
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
#pragma config PWRTE = ON       // Power-up Timer Enable bit (PWRT enabled)
#pragma config BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
#pragma config LVP = OFF        // Low-Voltage (Single-Supply) In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
#pragma config CPD = OFF        // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
#pragma config WRT = OFF        // Flash Program Memory Write Enable bits (Write protection off; all program memory may be written to by EECON control)
#pragma config CP = OFF         // Flash Program Memory Code Protection bit (Code protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

void main(void) 
{
    TRISB = 0b00000000;//Puerto B como salida
    PORTB = 0x00;//Limpiamos el puerto B 0v
    
    while(1)
    {
        PORTBbits.RB0 = 1;//Encendemos el led RB0 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB0 = 0;//Apagamos el led RB0
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB1 = 1;//Encendemos el led RB1 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB1 = 0;//Apagamos el led RB1
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB2 = 1;//Encendemos el led RB2 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB2 = 0;//Apagamos el led RB2
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB3 = 1;//Encendemos el led RB3 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB3 = 0;//Apagamos el led RB3
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB4 = 1;//Encendemos el led RB4 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB4 = 0;//Apagamos el led RB4
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB5 = 1;//Encendemos el led RB5 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB5 = 0;//Apagamos el led RB5
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB6 = 1;//Encendemos el led RB6 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB6 = 0;//Apagamos el led RB6
        __delay_ms(500);//Esperamos otros 500ms
        PORTBbits.RB7 = 1;//Encendemos el led RB7 del puerto B
        __delay_ms(500);//Esperamos un tetardo de 500ms
        PORTBbits.RB7 = 0;//Apagamos el led RB7
        __delay_ms(500);//Esperamos otros 500ms
    }    
        
    return;
}
